In [1]:
import pandas as pd

In [ ]:
lst=['a','b','c']
print(lst)

In [ ]:
df1=pd.DataFrame(lst)
print(df1)

In [ ]:
ls_of_ls=[[1,2,3],[2,3,4],[4,5,6]]
print(ls_of_ls)

In [ ]:
df2=pd.DataFrame(ls_of_ls)
df2

In [ ]:
dict1={'ID':[11,22,33,44],'SN':[1,2,3,4]}
dict1

In [ ]:
df3=pd.DataFrame(dict1)
df3

In [2]:
india_weather=pd.DataFrame({
    'city':['mumbai','delhi','banglore'],
    'temperature':[32,45,30],
    'humadity':[80,60,78]
})
india_weather

       city  temperature  humadity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [3]:
us_weather=pd.DataFrame({
    'city':['newyork','chicago','orlands'],
    'temperature':[21,14,35],
    'humadity':[68,65,75]
})
us_weather

      city  temperature  humadity
0  newyork           21        68
1  chicago           14        65
2  orlands           35        75

In [4]:
df=pd.concat([india_weather,us_weather])
df

       city  temperature  humadity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0   newyork           21        68
1   chicago           14        65
2   orlands           35        75

In [5]:
df=pd.concat([india_weather,us_weather],ignore_index=True)
df

       city  temperature  humadity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3   newyork           21        68
4   chicago           14        65
5   orlands           35        75

In [6]:
df=pd.concat([india_weather,us_weather],keys=['india','us'])
df

             city  temperature  humadity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0   newyork           21        68
      1   chicago           14        65
      2   orlands           35        75

In [7]:
df.loc['india']

       city  temperature  humadity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [8]:
df.loc['us']

      city  temperature  humadity
0  newyork           21        68
1  chicago           14        65
2  orlands           35        75

In [9]:
temperature_df=pd.DataFrame({
    'city':['mumbai','delhi','banglore'],
    'temperature':[32,45,30],
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [10]:
windspeed_df=pd.DataFrame({
    'city':['mumbai','delhi'],
    'windspeed':[7,12],
},index=[1,0])
windspeed_df

     city  windspeed
1  mumbai          7
0   delhi         12

In [11]:
df=pd.concat([temperature_df,windspeed_df])
df

       city  temperature  windspeed
0    mumbai         32.0        NaN
1     delhi         45.0        NaN
2  banglore         30.0        NaN
1    mumbai          NaN        7.0
0     delhi          NaN       12.0

In [12]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32   delhi       12.0
1     delhi           45  mumbai        7.0
2  banglore           30     NaN        NaN

In [13]:
s=pd.Series(['Humid','Dry','Rain'],name='evemt')
s

0    Humid
1      Dry
2     Rain
Name: evemt, dtype: object

In [14]:
df=pd.concat([temperature_df,s],axis=1)
df

       city  temperature  evemt
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain